Repository: pld-linux/wmakerconf
Catalog: wmakerconf.*.po
Languages: pl

source: No
pl: Nie

source: Yes
pl: Tak

source: Close
pl: Zamknij

source: Info
pl: Informacje

source: Question
pl: Pytanie

source: Warning
pl: Ostrze¿enie

source: Error
pl: B³±d

source: Press this button to activate capture mode - then press the desired key sequence.
pl: Naci¶nij ten przycisk, aby uaktywniæ tryb przechwytywania - nastêpnie wprowad¼ ¿±dan± sekwencjê klawiszy.

source: Save
pl: Zapisz

source: Open...
pl: Otwórz...

source: Revert...
pl: Przywróæ...

source: Upgrade
pl: Uaktualnij

source: Exit
pl: Zakoñcz

source: Tooltips
pl: Podpowiedzi

source: About
pl: O programie

source: Manual
pl: Podrêcznik

source: Messages
pl: Wiadomo¶ci

source: Update previews
pl: Uaktualnij podgl±dy

source: Linuxberg themes
pl: Tematy z Linuxberg

source: Largo's themes
pl: Tematy z Largo

source: Homepage
pl: Strona domowa

source: File
pl: Plik

source: Themes
pl: Tematy

source: Help
pl: Pomoc

source: Exit wmakerconf
pl: Koñczy program wmakerconf

source: Save WindowMaker file
pl: Zapisuje plik WindowMaker

source: Documentation
pl: Dokumentacja

source: Upgrade wmakerconf-data package via HTTP.
pl: Uaktualnia pakiet wmakerconf-data przez HTTP.

source: Wmakerconf homepage
pl: Strona domowa programu wmakerconf

source: Cancel
pl: Anuluj

source: Revert to backupfile of `WindowMaker' and `WMRootMenu' and exit wmakerconf?
pl: Odtworzyæ z kopii zapasowej plik `WindowMaker' oraz `WMRootMenu' i zakoñczyæ program wmakerconf?

source: Can't revert to backupfile of `WindowMaker'. Please manually revert from file WindowMaker.bak.
pl: Nie mo¿na odtworzyæ pliku `WindowMaker' z kopii zapasowej. Przywróæ ten plik rêcznie z pliku WindowMaker.bak.

source: Can't revert to backupfile of `WMRootMenu'. Please manually revert from file WMRootMenu.bak.
pl: Nie mo¿na odtworzyæ pliku `WMRootMenu' z kopii zapasowej. Przywróæ ten plik rêcznie z pliku WMRootMenu.bak.

source: Can't open selected file.
pl: Nie mo¿na otworzyæ zaznaczonego pliku.

source: Open a style, theme, or WindowMaker file.
pl: Otwiera styl, temat lub plik WindowMakera.

source: Out of memory!
pl: Brak pamiêci!

source: Can't find passwd entry to expand `~' in filename %s
pl: Nie mo¿na znale¼æ wpisu w passwd do rozwiniêcia `~' w nazwie pliku %s

source: Insert...
pl: Wstaw...

source: Insert new directory.
pl: Wstawia nowy katalog.

source: Remove
pl: Usuñ

source: Remove selected directory.
pl: Usuwa zaznaczony katalog.

source: Choose directory
pl: Wybierz katalog

source: Pixmap Browser
pl: Przegl±darka Piksmap

source: Window Maker's searchpath for pixmaps
pl: ¦cie¿ka przeszukiwania piksmap

source: Filename:
pl: Nazwa pliku:

source: Application menu configuration requires that your menu file
pl: Konfiguracja menu aplikacji wymaga, aby twój pliku menu

source: is in the new format.
pl: by³ w nowym formacie.

source: Convert current menu
pl: Konwertuj bie¿±ce menu

source: Convert current menu file to new format.
pl: Konwertuje bie¿±cy plik menu do nowego formatu.

source: Start with empty menu
pl: Rozpocznij z pustym menu

source: Replace current menu file with an empty one.
pl: Zastêpuje bie¿±cy plik menu pustym.

source: Use predefined menu
pl: U¿yj predefiniowanego menu

source: Use one of Window Maker's predefined menus as a starting point.
pl: Wykorzystuje jedno z predefiniowanych menu WindowMakera jako punkt wyj¶cia.

source: Window Maker root menu file '%s' saved.
pl: Plik g³ównego menu Window Makera '%s' zapisany.

source: Can't write to menu file `%s'
pl: Nie mo¿na zapisaæ pliku menu `%s'

source: Menu(item) label
pl: Etykieta (pozycji) menu

source: Command
pl: Polecenie

source: Show confirm panel
pl: Poka¿ panel potwierdzenia

source: Command:
pl: Polecenie:

source: Commandline of application to execute. A %s directive is replaced by the current selection, %w by the XID of the focused window, and %a(title[,prompt]) pops up an input box with specified title and optional prompt and substitutes with the typed text.
pl: Polecenie do uruchomienia aplikacji. %s jest zamieniane na aktualne zaznaczenie, %w na XID aktywnego okna, natomiast %a(tytu³[,zg³oszenie]) wywo³uje okno wstawiania o okre¶lonym tytule, z (opcjonalnym) zg³oszeniem i wprowadzonym tekstem.

source: Commandline to generate dynamic menu.
pl: Polecenie generuj±ce dynamiczne menu.

source: Import
pl: Importuj

source: Import output of command. The 'include dynamic menu' item is removed afterwards.
pl: Importuje wynik polecenia. Pozycja 'do³±cz dynamiczne menu' jest pó¼niej usuwana.

source: Name:
pl: Nazwa:

source: Name of window manager to start. If omitted, restart Window Maker.
pl: Nazwa zarz±dcy okien do uruchomienia. Je¶li pominiêto, Window Maker zostanie uruchomiony ponownie.

source: File:
pl: Plik:

source: Filename of menu to include.
pl: Nazwa pliku menu do do³±czenia.

source: Import contents of selected menu file. The 'include menu file' item is removed afterwards.
pl: Importuje zawarto¶æ wybranego pliku menu. Pozycja 'do³±cz plik menu' jest pó¼niej usuwana.

source: Browse...
pl: Przegl±daj...

source: Open file browser to select include file.
pl: Otwórz przegl±darkê plików, aby zaznaczyæ plik do do³±czenia.

source: Directory list
pl: Lista katalogów

source: Recursively, a submenu with all files and subdirectories of the given directory list is generated - each file is then used as argument for `command'. If `command' is omitted, a submenu with all executable files is generated.
pl: Z podanego katalogu oraz wszytkich jego podkatalogów i plików w nich zawartych, rekursywnie, zostanie wygenerowane podmenu -- ka¿dy plik zostanie u¿yty jako argument dla `polecenia'. Je¶li `polecenie' jest pominiête to generowane jest podmenu zawieraj±ce wszystkie pliki wykonywalne.

source: Strip suffix of filenames
pl: Usuñ koñcówki w nazwach plików

source: Shortcut
pl: Skrót

source: Submenu
pl: Podmenu

source: Include menu file
pl: Do³±cz plik menu

source: Include dynamic menu
pl: Do³±cz dynamiczne menu

source: Include directory menu
pl: Do³±cz menu z katalogu

source: Execute application
pl: Uruchom aplikacjê

source: Execute shell command
pl: Wykonaj polecenie pow³oki

source: Refresh screen
pl: Od¶wie¿ ekran

source: (Re)start window manager
pl: Uruchom (ponownie) zarz±dcê okien

source: Exit Window Maker
pl: Zakoñcz Window Makera

source: Exit session
pl: Zakoñcz sesjê

source: Workspace menu
pl: Menu pulpitu

source: Arrange miniwindows
pl: Rozmieszczaj miniokna

source: Hide other windows
pl: Ukryj inne okna

source: Show all windows
pl: Poka¿ wszystkie okna

source: Save session
pl: Zapisz sesjê

source: Discard session data
pl: Zignoruj dane sesji

source: Show info panel
pl: Poka¿ panel informacyjny

source: Show legal panel
pl: Poka¿ panel o prawach autorskich

source: Insert new command
pl: Wstaw nowe polecenie

source: Insert new submenu
pl: Wstaw nowe podmenu

source: Insert GNOME menu
pl: Wstaw menu GNOME

source: Insert KDE menu
pl: Wstaw menu KDE

source: Insert RedHat menu
pl: Wstaw menu RedHata

source: Insert Debian menu
pl: Wstaw menu Debiana

source: Insert default menu
pl: Wstaw domy¶lne menu

source: Cut item/submenu
pl: Wytnij pozycjê/podmenu

source: Paste item/submenu
pl: Wklej pozycjê/podmenu

source: Expand submenus
pl: Rozwiñ wszystkie podmenu

source: Collapse submenus
pl: Zwiñ wszystkie podmenu

source: Menu file selection
pl: Wybór pliku menu

source: Output of command '%s'
pl: Wynik polecenia '%s'

source: Imported file '%s'
pl: Importowany plik '%s'

source: Can't execute dynamic menu command. Please check `stderr' for more details.
pl: Nie mo¿na wykonaæ polecenia dynamicznego menu. Sprawd¼ `stderr', aby uzyskaæ wiêcej szczegó³ów.

source: Can't read file '%s'
pl: Nie mo¿na odczytaæ pliku '%s'

source: Can't convert old style menu %s to menu in proplist format. Please check `stderr' for more details.
pl: Nie mo¿na skonwertowaæ starego menu %s do nowego formatu. Sprawd¼ `stderr', aby uzyskaæ wiêcej szczegó³ów.

source: Can't parse generated menu file `%s'. Please check syntax of this file.
pl: B³±d interpretacji wygenerowanego pliku menu `%s'. Sprawd¼ sk³adniê w tym pliku.

source: Font
pl: Czcionka

source: Color of title text
pl: Kolor tekstu na pasku tytu³owym

source: Solid color
pl: Jednolity kolor

source: Drop shadow
pl: Cieniowany

source: A solid color or a drop shadow.
pl: Jednolity kolor lub cieniowany.

source: Foreground
pl: Pierwszy plan

source: Shadow 1
pl: Cieñ 1

source: Shadow 2
pl: Cieñ 2

source: Undefined boolean value '%s' converted to true.
pl: Niezdefiniowana warto¶æ logiczna '%s' zmieniona na 'prawda'.

source: Font selection
pl: Wybór czcionki

source: Workspace
pl: Pulpit

source: For each workspace a different texture can be specified. The texture of the default workspace is used if the texture type is set to 'default' for a specific workspace.
pl: Dla ka¿dego pulpitu mo¿na okre¶liæ odzielny rodzaj tekstury. Je¶li dla konkretnego pulpitu zostanie wybrany 'domy¶lny' rodzaj tekstury, to u¿yta zostanie tekstura domy¶lnego pulpitu.

source: A solid color, a pixmap, a gradient, or a gradient combined with a pixmap. If 'None' is selected, then the root background is not changed by Window Maker. If 'Default' is selected, then the texture of the default workspace is used
pl: Jednolity kolor, piksmapa, gradient lub gradient po³±czony z piksmap±. Je¶li 'Brak', g³ówne t³o nie jest zmieniane przez Window Makera. W przypadku, gdy wybrano rodzaj 'Domy¶lny', u¿yta zostanie tekstura domy¶lnego pulpitu.

source: A solid color, a pixmap, a gradient, or a gradient combined with a pixmap.
pl: Jednolity kolor, piksmapa, gradient lub gradient po³±czony z piksmap±.

source: A solid color, a pixmap, a gradient, or a gradient combined with a pixmap. If 'None' is selected, then the root background is not changed by Window Maker.
pl: Jednolity kolor, piksmapa, gradient lub gradient po³±czony z piksmap±. Je¶li 'Brak', g³ówne t³o nie jest zmieniane przez Window Makera.

source: Type
pl: Rodzaj

source: Pixmap
pl: Piksmapa

source: Centered: The pixmap will be shown centered. Tiled: The pixmap will be tiled in the destination. Scaled: The pixmap will be scaled to adapt to the destination's size. Scaled (x:y): The pixmap will be scaled to adapt to the destination's size but will maintain aspect ratio.
pl: Wy¶rodkowana: Piksmapa zostanie wy¶rodkowana na ekranie. S±siaduj±ca: Powielone piksmapy zostan± u³o¿one jedna przy drugiej. Skalowana: Piksmapa zostanie dostosowana do rozmiarów ekranu. Skalowana (x:y): Piksmapa zostanie dostosowana do rozmiarów ekranu z zachowaniem oryginalnych proporcji.

source: Centered: The pixmap will be shown centered. Tiled: The pixmap will be tiled in the destination. Scaled: The pixmap will be scaled to adapt to the destination's size.
pl: Wy¶rodkowana: Piksmapa zostanie wy¶rodkowana na ekranie. S±siaduj±ca: Powielone piksmapy zostan± u³o¿one jedna przy drugiej. Skalowana: Piksmapa zostanie dostosowana do rozmiarów ekranu.

source: Filename of the pixmap. <RETURN> checks if the pixmap filename is valid.
pl: Nazwa pliku piksmapy. <RETURN> sprawdza, czy nazwa pliku jest prawid³owa.

source: Use file browser to select pixmap.
pl: U¿yj przegl±darki plików, aby wybraæ piksmapê.

source: Previews...
pl: Podgl±dy...

source: Use preview browser to select pixmap.
pl: U¿yj przegl±darki podgl±dów, aby wybraæ piksmapê.

source: Gradient
pl: Wype³nienie gradientowe

source: Horizontal: A gradient going from left to right. Vertical: A gradient going from top to bottom. Diagonal: A gradient going from the top-left corner to the bottom-right corner. Always from color 1 to color 2
pl: Poziomo: Wype³nienie gradientowe od lewej do prawej. Pionowo: Wype³nienie gradientowe z góry na dó³. Uko¶nie: Wype³nienie gradientowe po przek±tnej -- od górnego prawego do dolnego lewego rogu ekranu. Zawsze od koloru 1 do koloru 2

source: Color 1:
pl: Kolor 1:

source: Color 2:
pl: Kolor 2:

source: Opacity:
pl: Krycie:

source: Opacity of the pixmap. If set to zero, only the pixmap is visible (and vice versa).
pl: Poziom krycia piksmapy. W przypadku, gdy ustawione jest '0', widoczna jest tylko piksmapa (i odwrotnie).

source: Default color
pl: Domy¶lny kolor

source: This color is used as solid color, if a gradient can't be drawn, or during the pixmap scaling/tiling process.
pl: Kolor u¿yty jako jednolity kolor, w przypadku gdy nie zosta³o u¿yte wype³nienie gradientowe lub w trakcie skalowania/rozmieszczania piksmap.

source: Bilinear gradient
pl: Dwuliniowe wype³nienie gradientowe

source: Color of the upper left corner.
pl: Kolor górnego, lewego rogu.

source: Color of the upper right corner.
pl: Kolor górnego, prawego rogu.

source: Color of the lower left corner.
pl: Kolor dolnego, lewego rogu.

source: Color of the lower right corner.
pl: Kolor dolnego, prawego rogu.

source: Fading vertical gradient
pl: Zanikaj±ce pionowe wype³nienie gradientowe

source: First color of gradient.
pl: Pierwszy kolor wype³nienia gradientowego.

source: Last color of gradient.
pl: Ostatni kolor wype³nienia gradientowego.

source: Waves gradient
pl: Faliste wype³nienie gradientowe

source: Number of sine layers.
pl: Liczba warstw sinusoid.

source: Frequency range of sine layers.
pl: Zakres czêstotliwo¶ci sinusoid w warstwach.

source: Horizontal: A gradient going from left to right. Vertical: A gradient going from top to bottom. Diagonal: A gradient going from the top-left corner to the bottom-right corner. Always from the first to the last color.
pl: Poziomo: Wype³nienie gradientowe od lewej do prawej. Pionowo: Wype³nienie gradientowe z góry na dó³. Uko¶nie: Wype³nienie gradientowe po przek±tnej -- od górnego, prawego do dolnego, lewego rogu ekranu. Zawsze od pierwszego do ostatniego koloru.

source: Insert
pl: Wstaw

source: Append
pl: Do³±cz

source: Remove selected color from gradient color list.
pl: Usuwa zaznaczony kolor z listy kolorów gradientowych.

source: Insert a new color before current color.
pl: Wstawia nowy kolor przed bie¿±cym kolorem.

source: Append a new color after the last color.
pl: Do³±cza nowy kolor po ostatnim kolorze.

source: Texture `%s' not yet supported or wrong number of arguments. Converting to (solid, black) ...
pl: Tekstura `%s' nie jest jeszcze obs³ugiwana lub podana zosta³a z³a liczba argumentów. Zmieniam na (jednolity, czarny) ...

source: Color selection
pl: Wybór koloru

source: Pixmap file browser
pl: Przegl±darka piksmap

source: Textured gradient
pl: Teksturowane wype³nienie gradientowe

source: None
pl: Brak

source: Default
pl: Domy¶lny

source: Fading gradient
pl: Zanikaj±ce wype³niene gradientowe

source: Scaled
pl: Skalowana

source: Tiled
pl: S±siaduj±ca

source: Centered
pl: Wy¶rodkowana

source: Scaled (x:y)
pl: Skalowana (x:y)

source: Horizontal
pl: Poziomo

source: Vertical
pl: Pionowo

source: Diagonal
pl: Uko¶nie

source: Theme
pl: Temat

source: Path
pl: ¦cie¿ka

source: Open
pl: Otwórz

source: Open selected theme.
pl: Otwiera zaznaczony temat.

source: Save...
pl: Zapisz...

source: Save current wmakerconf settings as a theme pack.
pl: Zapisuje aktualne ustawienia wmakerconfa jako zestaw tematyczny.

source: Set
pl: Ustaw

source: Open selected theme, update wmakerconf, and save wmakerconf settings.
pl: Otwiera zaznaczony temat, uaktualnia i zapisuje ustawienia wmakerconfa.

source: Preview
pl: Podgl±d

source: Preview the selected theme.
pl: Podgl±d zaznaczonego tematu.

source: Remove...
pl: Usuñ...

source: Remove themes with associated files and directories.
pl: Usuwa tematy ³±cznie z powi±zanymi z nimi plikami i katalogami.

source: Install...
pl: Instaluj...

source: Install themes (local or via WWW request).
pl: Instaluje tematy (lokalnie lub przez WWW).

source: Can't write temporary theme file. Please check `stderr' for more details.
pl: Nie mo¿na zapisaæ tymczasowego pliku tematu. Sprawd¼ `stderr', aby uzyskaæ wiêcej szczegó³ów.

source: Can't open temporary theme file. Please check `stderr' for more details.
pl: Nie mo¿na otworzyæ tymczasowego pliku tematu. Sprawd¼ `stderr', aby uzyskaæ wiêcej szczegó³ów.

source: Attribute %s not yet supported.
pl: Atrybut %s nie jest jeszcze wspierany.

source: Save a theme
pl: Zapisz temat

source: Install path
pl: ¦cie¿ka instalacji

source: Theme name
pl: Nazwa tematu

source: Can't write theme. Please check `stderr' for more details.
pl: Nie mo¿na zapisaæ tematu. Sprawd¼ `stderr', aby uzyskaæ wiêcej szczegó³ów.

source: Can't show preview of theme `%s'. Please check `stderr' for more details.
pl: Nie mo¿na wy¶wietliæ podgl±du tematu `%s'. Sprawd¼ `stderr', aby uzyskaæ wiêcej szczegó³ów.

source: Can't revert to old theme. Please check `stderr' for more details.
pl: Nie mo¿na przywróciæ poprzedniego tematu. Sprawd¼ `stderr', aby uzyskaæ wiêcej szczegó³ów.

source: Show next preview
pl: Poka¿ nastêpny podgl±d

source: Leave preview mode
pl: Opu¶æ tryb podgl±du

source: Can't open selected theme.
pl: Nie mo¿na otworzyæ zaznaczonego tematu.

source: Remove themes
pl: Usuñ tematy

source: Remove selected theme files
pl: Usuñ zaznaczone pliki tematów

source: Theme pixmaps
pl: Piksmapy tematu

source: Install themes
pl: Instaluj tematy

source: List of themes
pl: Lista tematów

source: Select themes with a file selection dialog (or use drag and drop with your file manager and WWW browser).
pl: Wybierz temat przy pomocy dialogu wyboru (albo 'przeci±gnij i upu¶æ' plik ze swojego zarz±dcy plików i przegl±darki WWW.

source: Install
pl: Instaluj

source: Choose themes to install
pl: Wybierz temat do zainstalowania

source: No installation prefix given.
pl: Nie podano prefiksu instalacji.

source: Skip
pl: Pomiñ

source: Can't unpack theme file. Please check `stderr' for more details.
pl: Nie mo¿na rozpakowaæ pliku tematu. Sprawd¼ `stderr', aby uzyskaæ wiêcej szczegó³ów.

source: Can't make directory `%s'. Please check `stderr' for more details.
pl: Nie mo¿na utworzyæ katalogu `%s'. Sprawd¼ `stderr', aby uzyskaæ wiêcej szczegó³ów.

source: Can't generate preview `%s'. Please check `stderr' for more details.
pl: Nie mo¿na wygenerowæ podgl±du dla `%s'. Sprawd¼ `stderr', aby uzyskaæ wiêcej szczegó³ów.

source: '%s': parse error.
pl: '%s': b³±d interpretacji.

source: Colors
pl: Kolory

source: Texture
pl: Tekstury

source: Directory $HOME/.wmakerconf does not exist yet. This directory is used to store the previews of all images. Should I generate this directory and the image previews now?
pl: Katalog $HOME/.wmakerconf jeszcze nie istnieje. Katalog ten jest wykorzystywany do przechowywania podgl±dów obrazków. Stworzyæ teraz ten katalog i wygenerowaæ podgl±dy obrazków?

source: Can't find pixmap '%s` in PixmapPath. Please update your PixmapPath attribute.
pl: Nie mo¿na znale¼æ piksmapy '%s` w PixmapPath. Uaktualnij zawarto¶æ PixmapPath.

source: Unable to display pixmap '%s` (format not supported). See stderr for subsequent messages.
pl: Nie mo¿na wy¶wietliæ piksmapy '%s` (format nie obs³ugiwany). Zobacz `stderr', aby uzyskaæ pozosta³e informacje.

source: Can't display pixmap '%s`.
pl: Nie mo¿na wy¶wietliæ piksmapy '%s`.

source: Some values are modified. Do you want to save them before quitting?
pl: Niektóre ustawienia zosta³y zmienione. Czy chcesz je zapisaæ przed zakoñczeniem?

source: Save before quitting?
pl: Zapisaæ przed zakoñczeniem?

source: Window Maker config file '%s' saved.
pl: Plik konfiguracyjny Window Makera '%s' zapisany.

source: Can't write to Window Maker file `%s'.
pl: Nie mo¿na zapisaæ pliku Window Makera `%s'.

source: Backupfile `%s' generated.
pl: Kopia zapasowa `%s' utworzona.

source: Can't write backupfile `%s'.
pl: Nie mo¿na zapisaæ kopii zapasowej `%s'.

source: Can't open global WindowMaker configuration file.
pl: Nie mo¿na otworzyæ globalnego pliku konfiguracyjnego WindowMakera.

source: New WindowMaker configuration file `%s' created.
pl: Nowy plik konfiguracyjny WindowMakera `%s' utworzony.

source: Can't generate configuration file `%s'.
pl: Nie mo¿na wygenerowaæ pliku konfiguracyjnego `%s'.
