Repository: pld-linux/wmakerconf
Catalog: wmakerconf-data.*.po
Languages: pl

source: Misc
pl: Ró¿ne

source: F/X
pl: Efekty

source: Paths
pl: ¦cie¿ki

source: Shortcuts
pl: Skróty

source: Appearance
pl: Wygl±d

source: Workspace
pl: Pulpit

source: Tiles
pl: Kafle

source: Dock and Clip
pl: Dok i Spinacz

source: Miniwindows
pl: Miniokna

source: Windows
pl: Okna

source: Focused titlebar
pl: Aktywny pasek

source: Unfocused titlebar
pl: Nieaktywny pasek

source: Parent titlebar
pl: Pasek okna macierzystego

source: Resizebar
pl: Pasek zmiany rozmiaru

source: Titlebuttons
pl: Przyciski paska

source: Menutitle
pl: Tytu³ menu

source: Menutext
pl: Tekst menu

source: Themes
pl: Tematy

source: If set then a window is automatically given focus when it is mapped.
pl: Automtycznie uaktywniaj nowo tworzone okno.

source: If set then windows are raised as you cycle through them.
pl: Podno¶ okna w trakcie przechodzenia z jednego na drugie.

source: If set then windows that are maximized are prevented from getting themselves under the dock.
pl: Zapobiegaj dostawaniu siê pod Dok powiêkszonych okien.

source: If set then windows that are maximized are prevented from overlapping minimized windows.
pl: Zapobiegaj przykrywaniu pomniejszonych okien przez powiêkszone okna.

source: If set then use new style titlebar buttons (startup option).
pl: U¿ywaj nowego stylu dla przycisków paska tytu³owego (opcja startowa).

source: If set then use useless stuff that bloats and slows down WindowMaker.
pl: U¿ywaj bezu¿ytecznych wodotrysków spowalniaj±cych WindowMakera.

source: If set then do not open the application Dock (startup option).
pl: Nie otwieraj Doku dla aplikacji (opcja startowa).

source: If set then do not open the application Clip (startup option).
pl: Nie otwieraj Spinacza aplikacji (opcja startowa).

source: If set then do not show miniwindows (startup option).
pl: Nie pokazuj pomniejszonych okien (opcja startowa).

source: When not set menus are opened in the NeXT way; i.e. the menu appears with the center of its titlebar where the mouse pointer is. This can mean the menu goes off the side of the screen. When set the menu is mapped so all of the menu is on the screen. Often used in conjuction with the ScrollableMenus option to get a neat menu effect.
pl: Je¶li ta opcja jest wy³±czona, to menu s± otwierane w stylu NeXTStep, tzn. menu otwiera siê w miejscu, gdzie znajduje siê wska¼nik myszy. Mo¿e to powodowaæ, ¿e menu bêdzie wychodziæ poza ekran. Gdy opcja jest w³±czona, menu jest wy¶wietlane tak, by pozostawa³o w ca³o¶ci widoczne. Opcja ta jest czêsto u¿ywana w po³±czeniu z opcj± ScrollableMenus, co daje ca³kiem mi³y efekt.

source: If part of a menu goes off screen and this option is set then the menu is scrolled back onto the screen as you move your mouse pointer towards the edge of the screen. When the pointer leaves the menu then it goes back to its original position.
pl: Je¶li czê¶æ menu wyjdzie poza ekran i ta opcja jest ustawiona, wtedy menu zostanie przewiniête z powrotem na ekran. Gdy wska¼nik myszy opu¶ci menu, powróci ono do oryginalnej pozycji.

source: If set then the titlebar of a submenu is at exactly the same height as the titlebar of its parent when opened. When not set the titlebar of the submenu is in such a position that the first submenu option is at the same height as the submenu item on the main menu.
pl: Je¶li ta opcja jest w³±czona, wtedy pasek tutu³owy podmenu jest dok³adnie na tej samej wysoko¶ci co pasek tytu³owy okna macierzystego. W przypadku, gdy opcja jest wy³±czona, pasek tytu³owy podmenu jest w takiej pozycji, ¿e pierwsza opcja w podmenu jest na tej samej wysoko¶ci co pozycja podmenu w g³ównym menu.

source: If set then transient windows open on the workspace of the owner process rather than on the current workspace.
pl: Otwieraj okna przej¶ciowe na pulpicie, na którym jest uruchomiony proces, do którego te okna nale¿±, zamiast na aktualnym pulpicie.

source: If set then the mouse click that causes a window to focus is not passed onto the application.
pl: Je¶li ta opcja jest w³±czona, to klikniêcie myszy powoduj±ce uaktywnienie okna nie jest przekazywane do aplikacji.

source: When set use saveunders in WindowMaker windows. This can improve performance but increases memory usage. It also can cause problems with refreshing in some applications.
pl: W³±cz tryb 'saveunders' w oknach WindowMakera. Mo¿e to poprawiæ wykonywanie operacji ale zwiêksza zu¿ycie pamiêci. Mo¿e równie¿ powodowaæ w niektórych aplikacjach problemy z od¶wierzaniem.

source: When set window contents are shown as they are moved.
pl: Pokazuj zawarto¶æ okien w trakcie ich przesuwania.

source: When set animations such as the minimize animation, shade animation and the "remove icon from dock" animation are disabled.
pl: Wy³±cz animacje towarzysz±ce m.in. pomniejszaniu i zwijaniu aplikacji lub usuwaniu ikon z Doku.

source: When set then automagically arrange icons if required.
pl: Automatycznie rozmieszczaj ikony w razie potrzeby.

source: If set then enable balloons for window titles that are not fully visible.
pl: W³±cz dymki dla tytu³ów okien, które nie s± ca³kowicie widoczne.

source: If set then enable balloons for miniwindow titles.
pl: W³±cz dymki dla tytu³ów pomniejszonych okien.

source: If set then enable balloons for application icons (docked or not).
pl: W³±cz dymki dla ikon aplikacji (zadokowanych lub nie).

source: If set then enable smoothing of scaled workspace background images.
pl: W³±cz wyg³adzanie skalowanych obrazków stanowi±cych t³o pulpitu.

source: If set then disable marching ants animation of selected mini windows.
pl: Wy³±cz animowane zaznaczenie pomniejszonych okien.

source: Specifies the position of the workspace name indicator.
pl: Pozycja wy¶wietlania nazwy pulpitu.

source: Specifies the style of the menu texture. Normal: one texture per item, with bevels in each item. SingleTexture: a single texture that spans the whole menu, with bevels in each item. Flat: SingleTexture without the bevels.
pl: Wygl±d tekstury menu. Normal: oddzielna tekstura na ka¿d± pozycjê, z wciêciami rozdzielaj±cymi ka¿d± z nich. SingleTexture: pojedyncza tekstura rozci±gaj±ca siê na ca³e menu, z wciêciami rozdzielaj±cymi ka¿d± pozycjê. Flat: pojedyncza tekstura bez wciêæ rozdzielaj±cych.

source: Position of icon box. ('t' top, 'b' bottom, 'l' left, 'r' right, 'h' horizontal, 'v' vertical)
pl: Pozycja paska ikon. ('t' góra, 'b' dó³, 'l' lewa strona, 'r' prawa strona, 'h' poziomo, 'v' pionowo)

source: If set then generate a new workspace if you try to advance from the last workspace.
pl: Przy przechodzeniu z ostatniego pulpitu na nastêpny twórz nowy pulpit.

source: If set then jump to the first workspace if you try to advance from the last workspace.
pl: Przy przechodzeniu z ostatniego pulpitu na nastêpny przeskocz na pulpit pierwszy.

source: If set do not automatically switch to the next or previous workspace when a window is dragged to the edge of the screen.
pl: Nie prze³±czaj automatycznie na nastêpny lub poprzedni pulpit podczas przesuwania okna do brzegu ekranu.

source: If set then you can use the KFM mouse popup menus from KDE. When not set it keeps you from 'touching' the root window with the mouse. In other words, you will not have access to your normal root popup menu with this enabled (startup option).
pl: W³±cz tê opcjê, je¶li chcesz mieæ mo¿liwo¶æ korzystania z menu KFM z KDE. Spowoduje to jednak, ¿e nie bêdziesz mieæ dostêpu do standardowego menu g³ównego WindowMakera (opcja startowa).

source: If set then autosave the session state on exit.
pl: Zapisuj automatycznie stan sesji przy wyj¶ciu.

source: If not set then minimized windows are workspace specific.
pl: W³±czenie tej opcji powoduje, ¿e pomniejszone okna nie s± powi±zane z konkretnym pulpitem.

source: If set then disable sound at runtime without the need of killing the sound server.
pl: Wy³±cz d¼wiêk przy starcie bez konieczno¶ci zabijania serwera d¼wiêku.

source: If set then gradients and pixmaps etc. are not dithered in low color mode (startup option).
pl: Nie poddawaj ditheringowi gradientów, pixmap, etc. w trybie zmniejszonej liczby kolorów (opcja startowa).

source: If set then disable confirmation panel for Kill.
pl: Wy³±cz panel potwierdzenia dla polecenia Zabij.

source: The mouse button to select multiple windows with the rubberband in the root window.
pl: Klawisz myszy do zaznaczenia wielu okien.

source: The mouse button to pop up the window list.
pl: Klawisz myszy do wy¶wietlenia listy okien.

source: The mouse button to activate the application menu.
pl: Klawisz myszy do wy¶wietlenia menu aplikacji.

source: This option specifies how windows should be focused or how mouse movements or clicks should affect focuses (startup option). Manual: You have to click on the window to focus it. Auto: The window currently being pointed to has focus. If you point at the Workspace then no window has focus. Semiauto: As Auto but when the Workspace is pointed to the window doesn't loose focus.
pl: Sposób w jaki powinny byæ uaktywniane okna (opcja startowa). Manual: Aby uaktywniæ okno musisz klikn±æ na nie mysz±. Auto: Okno zostaje uaktywnione, gdy kursor myszy znajdzie siê w jego obrêbie. Gdy kursor myszy wska¿e na Pulpit, ¿adne okno nie bêdzie aktywne. Semiauto: Podobnie jak Auto, z t± ró¿nic±, ¿e po wskazaniu na Pulpit okno pozostaje aktywne.

source: On lower color displays not all colors may be available to applications as they want them. Normally the most colors are given to the application that has the focus. This option specifies what technique to use to decide which application has the most colors. Auto: The window currently being pointed to will get the most colors. Manual: You have to click on the window to give to it the most colors. SemiAuto: As Auto but when the Workspace is pointed to the window doesn't loose focus.
pl: W trybie o mniejszej liczbie kolorów nie wszystkie kolory, jakie s± wymagane przez aplikacje bêd± dla nich dostêpne. Zazwyczaj najwiêksz± liczbê kolorów otrzymuje aplikacja której okno jest w danym momencie aktywne. Tu mo¿esz wybraæ, w jaki sposób bêdzie podejmowana decyzja, której aplikacji przyznaæ najwiêksz± liczbê kolorów. Auto: Najwiêcej kolorów otrzyma okno, w którego obszarze znajduje siê aktualnie kursor myszy. Manual: Najwiêcej kolorów otrzyma okno, na którym klikniesz mysz±. SemiAuto: Podobnie jak Auto, z t± ró¿nic±, ¿e w po wskazaniu na Pulpit okno nie traci przyznanych mu kolorów.

source: Specifies how to display the geometry box when resizing the window. Corner: Geometry display box appears in the top left. Center: Geometry box appears in the screen center. Floating: Geometry display box keeps with the window. Line: No geometry display box but some cool lines around the egde.
pl: Sposób wy¶wietlania informacji o geometrii okna podczas zmiany jego rozmiarów. Corner: Panel z wymiarami pojawia siê w lewym, górnym rogu ekranu. Center: Panel z wymiarami pojawia siê po¶rodku ekranu. Floating: Panel z wymiarami jest przypisany do okna. Line: Wymiary okien podane s± przy pomocy linii przy krawêdziach okna.

source: Specifies how to display the geometry box when moving the window. Corner: Geometry display box appears in the top left. Center: Geometry box appears in the screen center. Floating: Geometry display box keeps with the window. Line: No geometry display box but some cool lines around the egde.
pl: Sposób wy¶wietlania informacji o geometrii okna podczas zmiany jego po³o¿enia. Corner: Panel ze wspó³rzêdnymi pojawia siê w lewym, górnym rogu ekranu. Center: Panel ze wspó³rzêdnymi pojawia siê po¶rodku ekranu. Floating: Panel ze wspó³rzêdnymi jest przypisany do okna. Line: Wspó³rzêdne okien podane s± przy pomocy linii przy krawêdziach okien.

source: Specifies how newly mapped windows should be placed. Cascade: Normal cascading effect. Auto: Puts the new window in the best free space. Manual: When the window is created you are given an outline, you have to choose where you want the window and then click to place it. Random: Puts it a random place.
pl: Sposób w jaki nowo tworzone okna powinny byæ rozmieszczane. Cascade: Efekt kaskady. Auto: Nowe okno umieszczane jest w najkorzystniejszym wolnym miejscu. Manual: Zamiast ca³ego okna tworzone s± jego kontury, które musisz przesun±æ w wybrane miejsce i klikn±æ mysz±, aby je tam pozostawiæ. Random: Nowe okno umieszczane jest w ca³kowicie przypadkowym miejscu.

source: Offset (in pixels) of all windows in auto or cascade placement mode before placing them on screen. First is horizontal direction and second is vertical. This does not apply to windows that request a specific position on screen.
pl: Wyrównanie wszystkich okien (w pikslach) w trybach rozmieszczania Auto i Cascade, przed tym jak zostan± umieszczone na ekranie. Pierwsza komórka okre¶la wyrównanie poziome, druga pionowe. Ta opcja nie dotyczy okien, które wymagaj± specjalnej pozycji na ekranie.

source: Justification of text in the window title bars. Center: Centered text. Left: Left Alignment of text. Right: Rigth alignment of text.
pl: Wyrównanie tekstu na paskach tytu³owych okien. Center: Wy¶rodkowany. Left: Wyrównany do lewej. Right: Wyrównany do prawej.

source: Whenever WindowMaker is given a relative path to find a texture pixmap in, it searches each of these paths in order for that pixmap.
pl: Za ka¿dym razem, gdy podano WindowMakerowi wzglêdn± ¶cie¿kê dostêpu do tekstury, przeszukiwana jest ka¿da z podanych tu ¶cie¿ek w celu odnalezienia w³a¶ciwej pixmapy.

source: Whenever WindowMaker is given a relative path to find a icon pixmap in, it searches each of these paths in order for that pixmap.
pl: Za ka¿dym razem, gdy podano WindowMakerowi wzglêdn± ¶cie¿kê dostêpu do ikony, przeszukiwana jest ka¿da z podanych tu ¶cie¿ek w celu odnalezienia w³a¶ciwej pixmapy.

source: Wmakerconf searches each of these paths in order for the list of available themes.
pl: Wmakerconf przeszukuje ka¿d± z podanych tu ¶cie¿ek w celu odnalezienia listy dostêpnych tematów.

source: The key to pop up the root menu.
pl: Klawisz do wy¶wietlenia g³ównego menu.

source: The key to pop up the window list.
pl: Klawisz do wy¶wietlenia listy okien.

source: The key to pop up the window commands menu for the focused window.
pl: Klawisz do wy¶wietlenia menu poleceñ dla aktywnego okna.

source: The key to lower the clip.
pl: Klawisz do upuszczania Spinacza.

source: The key to raise the clip.
pl: Klawisz do podnoszenia Spinacza.

source: The key to raise or lower the clip.
pl: Klawisz do podnoszenia lub upuszczania Spinacza.

source: The key to iconify a window.
pl: Klawisz do pomniejszania okna do ikony.

source: The key to maximize the focused window to it's full size.
pl: Klawisz do powiêkszania aktywnego okna do jego pe³nych rozmiarów.

source: The key to maximize the focused window to it's full vertical size.
pl: Klawisz do powiêkszania aktywnego okna do jego pe³nej wysoko¶ci.

source: The key to move or resize the focused window.
pl: Klawisz do zmiany pozycji lub rozmiaru aktywnego okna.

source: The key to lower the focused window to the bottom.
pl: Klawisz do upuszczania aktywnego okna na spód.

source: The key to raise the focused window to the top.
pl: Klawisz do podnoszenia aktywnego okna na wierzch.

source: The key to raise or lower the window under the mouse pointer.
pl: Klawisz do podnoszenia i upuszczania okna znajduj±cego siê pod wska¼nikiem myszy.

source: The key to switch input focus to the next window.
pl: Klawisz do prze³±czenia na nastêpne okno w tryb wstawiania.

source: The key to switch input focus to the previous window.
pl: Klawisz do prze³±czenia na poprzednie okno w tryb wstawiania.

source: The key to shade the focused window.
pl: Klawisz do zwiniêcia aktywnego okna.

source: The key to close the focused window.
pl: Klawisz do zamkniêcia aktywnego okna.

source: The key to hide an application (if supported).
pl: Klawisz do ukrycia aplikacji (je¶li wspierane).

source: The key to select a window.
pl: Klawisz do zaznaczenia okna.

source: The key to switch to the next workspace.
pl: Klawisz do prze³±czenia na nastêpny pulpit.

source: The key to switch to the previous workspace.
pl: Klawisz do prze³±czenia na poprzedni pulpit.

source: The key to switch to the next 10 workspace set.
pl: Klawisz do prze³±czenia na nastêpny zestaw 10-ciu pulpitów.

source: The key to switch to the previous 10 workspace set.
pl: Klawisz do prze³±czenia na poprzedni zestaw 10-ciu pulpitów.

source: The key to switch to user selected window 1. To assign a shortcut to a window use the 'Options->Select Shortcut' submenu in the window commands menu. The shortcut will do the same as clicking in an entry in the window list menu.
pl: Klawisz do prze³±czenia na wybrane przez u¿ytkownika okno 1. W celu przypisania skrótu do okna u¿yj polecenia 'Opcje->Wybierz Skrót' w menu poleceñ okna. Skrót daje taki sam efekt jak wybranie pozycji z listy okien.

source: The key to switch to user selected window 2. To assign a shortcut to a window use the 'Options->Select Shortcut' submenu in the window commands menu. The shortcut will do the same as clicking in an entry in the window list menu.
pl: Klawisz do prze³±czenia na wybrane przez u¿ytkownika okno 2. W celu przypisania skrótu do okna u¿yj polecenia 'Opcje->Wybierz Skrót' w menu poleceñ okna. Skrót daje taki sam efekt jak wybranie pozycji z listy okien.

source: The key to switch to user selected window 3. To assign a shortcut to a window use the 'Options->Select Shortcut' submenu in the window commands menu. The shortcut will do the same as clicking in an entry in the window list menu.
pl: Klawisz do prze³±czenia na wybrane przez u¿ytkownika okno 3. W celu przypisania skrótu do okna u¿yj polecenia 'Opcje->Wybierz Skrót' w menu poleceñ okna. Skrót daje taki sam efekt jak wybranie pozycji z listy okien.

source: The key to switch to user selected window 4. To assign a shortcut to a window use the 'Options->Select Shortcut' submenu in the window commands menu. The shortcut will do the same as clicking in an entry in the window list menu.
pl: Klawisz do prze³±czenia na wybrane przez u¿ytkownika okno 4. W celu przypisania skrótu do okna u¿yj polecenia 'Opcje->Wybierz Skrót' w menu poleceñ okna. Skrót daje taki sam efekt jak wybranie pozycji z listy okien.

source: The key to switch to workspace 1.
pl: Klawisz do prze³±czenia na pulpit 1.

source: The key to switch to workspace 2.
pl: Klawisz do prze³±czenia na pulpit 2.

source: The key to switch to workspace 3.
pl: Klawisz do prze³±czenia na pulpit 3.

source: The key to switch to workspace 4.
pl: Klawisz do prze³±czenia na pulpit 4.

source: The key to switch to workspace 5.
pl: Klawisz do prze³±czenia na pulpit 5.

source: The key to switch to workspace 6.
pl: Klawisz do prze³±czenia na pulpit 6.

source: The key to switch to workspace 7.
pl: Klawisz do prze³±czenia na pulpit 7.

source: The key to switch to workspace 8.
pl: Klawisz do prze³±czenia na pulpit 8.

source: The key to switch to workspace 9.
pl: Klawisz do prze³±czenia na pulpit 9.

source: The key to switch to workspace 10.
pl: Klawisz do prze³±czenia na pulpit 10.

source: The modifier to use as the "Meta" key. (startup option)
pl: Klawisz u¿ywany jako "Meta". (opcja startowa)

source: The font to use for window titles.
pl: Czcionka dla pasków tytu³owych okien.

source: The font to use for menu window titles.
pl: Czcionka dla menu pasków tytu³owych okien.

source: The font to use for menu item text.
pl: Czcionka dla pozycji w menu.

source: The font to use for the icon title.
pl: Czcionka dla paska tytu³owego ikony.

source: The font to use for the workspace name and number in the clip's main icon.
pl: Czcionka dla nazwy pulpitu i numeru na g³ównej ikonie Spinacza.

source: The font to use for text in things like WindowMaker dialogs etc.
pl: Czcionka wykorzystywana w dialogach WindowMakera, itp.

source: Size of dithering colormap in colors per channel (startup option).
pl: Rozmiar ditheringu mapy kolorów w kolorach na kana³ (opcja startowa).

source: Width and height of icons (startup option).
pl: Szeroko¶æ i wysoko¶æ ikon (opcja startowa).

source: Delay in milliseconds before a newly focused window is raised. 0 disables this feature.
pl: Opó¼nienie (w milisekundach) zanim uaktywnione okno zostanie podniesione. 0 wy³±cza ten efekt.

source: Speed of menu scrolling.
pl: Szybko¶æ przewijania menu.

source: Speed of icon slide.
pl: Szybko¶æ przesuwania siê ikony.

source: Speed of window shading.
pl: Szybko¶æ zwijania okna.

source: Style of miniaturization animation.
pl: Wygl±d animacji pomniejszania.

source: The time for the double click to be considered so.
pl: Czas, w jakim podwójne klikniêcie jest za takie uwa¿ane.

source: Resistance for stopping windows from moving outside of the screen. The number represents the number of pixels of resistance.
pl: Liczba piksli stanowi±ca margines przy zapobieganiu przed wychodzeniem okien poza brzeg ekranu.

source: The color of the text on a menu title.
pl: Kolor tekstu na pasku tytu³owym menu.

source: Text
pl: Tekst

source: The color of the text on a menu item.
pl: Kolor tekstu pozycji menu.

source: Text (normal)
pl: Tekst (normalny)

source: The color of the text on a disabled menu item.
pl: Kolor tekstu nieaktywnej pozycji menu.

source: Text (disabled)
pl: Tekst (pod¶wietlony)

source: The color of the text on a menu highlight.
pl: Kolor t³a pod¶wietlonej pozycji menu.

source: Text (highlight)
pl: Tekst (pod¶wietlony)

source: The background color of a menu highlight.
pl: Kolor t³a pod¶wietlonej pozycji menu.

source: Background (highlight)
pl: T³o (pod¶wietlone)

source: The color of the text on the icon title.
pl: Kolor tekstu na pasku tytu³owym ikony.

source: The background color of the icon title.
pl: Kolor t³a paska tytu³owego ikony.

source: Background
pl: T³o

source: The color of the text on a focused window title.
pl: Kolor tekstu na pasku tytu³owym aktywnego okna.

source: The color of the text on the title of the parent of the focused window.
pl: Kolor tekstu na pasku tytu³owym okna macierzystego dla aktywnego okna.

source: The color of text on an unfocused window title.
pl: Kolor tekstu na pasku tytu³owym nieaktywnego okna.

source: The color of the workspace name and number on the clip's main icon.
pl: Kolor nazwy pulpitu i numeru na g³ównej ikonie Spinacza.

source: Text (active)
pl: Tekst (aktywny)

source: The color of the workspace name and number on the clip's main icon when the clip is collapsed.
pl: Kolor nazwy pulpitu i numeru na g³ównej ikonie Spinacza, gdy Spinacz jest wygaszony.

source: Text (collapsed)
pl: Tekst (wygaszony)

source: The style of the root window.
pl: Wygl±d g³ównego okna.
